<?php

namespace Database\Seeders;

use App\Models\Ingredient;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\File;

class IngredientsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $ingredients = [
            '၀က်သား', 'ကြက်သား', 'အမဲသား', 'ဆိတ်သား', 'ငါး', 'ကင်းမွန်', 'ပုဇွန်', 'ဂဏန်း', 'ပြည်ကြီးငါး', '‌ရေဘဝဲ',
            'ငါးဖယ်', 'ဂုံးမင်း', 'ကြက်/၀က်', 'ကြက်/၀က်/အမဲ/ဆိတ်', 'ပုဇွန်/ရေဘ၀ဲ/ကင်းမွန်', 'ကြက်သွန်နီ', 'ကြက်သွန်ဖြူ',
            'အာလူး', 'မုန်လာဥနီ', 'ဂျင်း', 'ဂျင်းစိမ်း', 'နနွင်း', 'ပဒဲကော', 'ကန်စွန်းဥ', 'ပိန်းဥ', 'မျှစ်', 'ကြာစွယ်',
            'မုန်လာဥ', 'မုန်လာဥဝါ', 'စိမ်းစားဥ', 'ပီလောပီနံဥ', 'ဝဥ', 'ကန်စွန်းရွက်', 'နံနံပင်', 'ကြက်သွန်မြိတ်',
            'ချဉ်ပေါင်ရွက်', 'ဆလပ်ရွက်', 'ဂေါ်ဖီထုပ်', 'ဂေါ်ဖီထုပ် အနီ', 'ကိုက်လန်ရွက်', 'မုန်ညင်းစိမ်း', 'မုန်ညင်းဖြူ',
            'ဟင်းနုနွယ်', 'မြင်းခွါရွက်', 'ပင်စိမ်းရွက်', 'ဗမာပင်စိမ်း', 'ယိုးဒယားပင်စိမ်း', 'ပူစီနံ', 'ရှမ်းနံနံ',
            'ပျဉ်းတော်သိမ်ရွက်', 'ဒန့်ဒလွန်ရွက်', 'ကင်ပွန်းချဉ်ရွက်', 'ဆူးပုတ်ရွက်', 'မယ်ဇလီရွက်', 'ရှောက်ရွက်',
            'မန်ကျည်းရွက်', 'ခရမ်းချဉ်သီး', 'ငရုတ်သီးစိမ်း', 'ငရုတ်ပွ', 'ခရမ်းသီး', 'ရုံးပတီသီး', 'ကြက်ဟင်းခါးသီး',
            'သခွါးသီး', 'ဘူးသီး', 'ရွှေဖရုံသီး', 'ဂေါ်ရခါးသီး', 'ခဝဲသီး', 'သပွတ်သီး', 'ပြောင်းဖူး', 'ပြောင်းဖူးအသေး',
            'ဒန့်ဒလွန်သီး', 'သင်္ဘောသီး', 'သံပုရာသီး', 'ရှောက်သီး', 'မကျည်းသီး', 'သလဲသီး', 'ပဲပြား', 'တို့ဟူး',
            'ပဲပင်ပေါက်', 'ပဲတောင့်ရှည်', 'ပဲစောင်းလျားသီး', 'ရွှေပဲသီး', 'ကုလားပဲ', 'ပဲကြီး', 'ပဲတီစိမ်း', 'ပဲနီလေး',
            'ပဲပိစပ်', 'မှို', 'ကောက်ရိုးမှို', 'ကြွက်နားရွက်မှို', 'ငွေနှင်းမှို', 'အပ်မှို', 'ရှီတာကီမှို', 'မှိုဘုရင်',
            'ဆား', 'သကြား', 'ငံပြာရည်', 'ဆီ', 'ငရုတ်ကောင်း', 'စပါးလင်', 'သစ်ကြံပိုးခေါက်', 'လေးညှင်းပွင့်', 'ငါးပိ',
            'ပုဇွန်ခြောက်', 'နှမ်း', 'ပဲကြာဇံ', 'ငါး‌သေတ္တာ', '‌ဆေးဘဲဥ', 'ကြက်ဥ/ဘဲဥ', 'Organic Wild Rocket Leaf',
        ];

        foreach ($ingredients as $name) {
            Ingredient::firstOrCreate(['name' => $name]);
        }
    }
}
